{"content_hash": "483c7f3223fb696ad94d4aefc82a364e", "document_id": 11, "plain_text": "70    COMMUNICATIONS OF THE ACM\n   |  OCTOBER 2017  \n|  VOL. 60  \n|  NO. 10\nreview articles\nIMAGE BY YIORGOS GR\nﬁEvery time you block an ad, what you™re really blocking is food from entering a child™s mouth.ﬂ\n25 ﬁIn reality, ad blockers are one of the few tools that we as \n\nusers have if we want to push back against the perverse design logic that has cannibalized the soul of the Web.ﬂ\n26IN FALL 2015\n, Apple introduced a ﬁcontent blockingﬂ extension point into its Safari mobile browser, \nproviding a hook for software that prevents advertisements from being loaded when Web pages \nare rendered.\n27 As it turned out, large \nnumbers of people wanted to do just \nthat.28 Ad blockers had been available for some time, but their potential use \nin the world™s most popular mobile browser heightened their saliency and \nbrought the debate over their useŠa debate sometimes serious and nu-anced, but often frivolousŠinto the mainstream media.29 To put the issue into perspective, \nconsider the following provided by PageFair, ﬁa leading provider of coun\n-\nter ad block solutions to Web publish\n-ers,ﬂ in its 201530 and 201631 reports on ad blocking: ˜Ad blocking was estimated to have cost publishers nearly $22 billion dur-\ning 2015. ˜As of November 2016, at least 309 million people are blocking advertis-\ning on their smartphones. ˜298 million of these people use an \nad blocking browser, more than twice \nthe number using blocking browsers in 2015. ˜Ad blocking is particularly popular in emerging markets, with the largest number of active monthly users in Chi-na, India, and Indonesia. The U.S. is in \n\nninth place.In its 2016 report, PageFair made \nthe following prediction: Mobile ad blocking is a serious threat to the future of media and journalism in emerging \nmarkets, where people are coming online for the ˜rst time via relatively expensive Internet \nAdvertising: \nTechnology, \nEthics, and \n\na Serious \n\nDifference \n of OpinionDOI:10.1145/3048384Exploring the technical and ethical issues \nsurrounding Internet advertising and ad blocking.\nBY STEPHEN B. WICKER AND KOLBEINN KARLSSON\n key insights\n ˚Internet advertisers use networks of \nsupply- and demand-side platforms and \n\nautomated auctions to deliver targeted \n\nadvertising to readers in a matter of \n\nmilliseconds. ˚Ad blocking is an existential threat to \nthe Internet advertising industry, with \n\ncosts to advertisers ranging in the tens of \n\nbillions of dollars. ˚The argument that ad blockers violate an \nimplicit contract between the reader and \n\ncontent provider fails on legal grounds.\n ˚A virtue ethics-based analysis clearly \n\nsupports ad blockers, while also \n\npointing to solutions that may bene˜t all \nstakeholders.OCTOBER 2017  \n|  VOL. 60  \n|  NO. 10  \n|  COMMUNICATIONS OF THE ACM\n    7172    COMMUNICATIONS OF THE ACM\n   |  OCTOBER 2017  \n|  VOL. 60  \n|  NO. 10\nreview articles\nSuppose the Web browser requests \na page from a content publisher that \nsupports his or her work through ad-vertising (this is represented in the \n\naccompanying ˜gure by link 1). Most \npublishers do not generate their own \nadvertising content, so they will embed \nrequests for advertising into the HTML \n˜les they send to requesting users (link \n\n2). When the requesting host attempts \nto render the HTML ˜le, it will generate \nrequests for advertisements from an ad \n\nexchange. The ad exchange, as shown in \nthe ˜gure, sits at the center of a network \nconsisting of supply side and demand \nside entities. The supply side entities \nprovide information about the user, \n\nwhile the demand side entities provide \nadvertising in response to requests \nfrom publishers.The HTML code provided by the \npublisher directs the host to a supply-\nside platform (SSPŠlink 3). The re-\nquest sent to the SSP includes a cook-ieŠa small string of information that \nwas previously stored by the SSP on the \nuser™s computer. The cookie enables \nthe SSP to craft a response that is specif-\nically tailored to the requesting user. In \nthis case, the cookie will include a user \nID that the ad exchange can use to co\n-\nordinate bidding for an advertisement. \nThe ad exchange forwards the user ID and any other information that it may have about the requesting user to one or more demand-side platforms \n(DSPs) that place bids on behalf of ad\n-vertisers for the opportunity to display their ads. Through a process known as \ncookie syncing, the DSPs are able to \nmatch the SSP cookie ID to a user pro-˜le, which is often stored and managed \n\nby a separate entity called a data man-agement platform (DMP).As multiple SSPs and DSPs can use \nthe same DMP, the DMP may link a wide \nrange of user IDs to the same person. \n\nThis enables all interested parties (other \nthan the user) to exchange information \non the user and form a more complete \n\npicture of that user™s browsing history. \nFirst-party websites may also partici-pate in the process, providing yet more \nuser information. For example, if a user \nsupplies an email address to a website \n\nto sign up for its newsletter, the email \naddress can be linked at the DMP to the \ncookie IDs associated with that user. If \n\nthe user provides a name and address \nto a website, that information may also \nor slow mobile connections. Usage in \nWestern economies is likely to grow as \nmore manufacturers and browsers start to include ad blocking as a feature.31Given the amount of money in\n-volved in advertising, one might expect a certain amount of invective on the subject of ad blocking. One would be \n\ncorrect. Ad blocking has been referred to as ﬁevil ﬁand as a form of ﬁtheft.ﬂ\n32 Ad Age, an advertising industry trade \nmagazine, accused ad blockers of be-ing exploitative, extortionate, and anti-\ndemocratic, all within the space of a single sentence:As abetted by for-pro˜t technology \ncompanies, ad blocking is robbery, plain \nand simpleŠan extortionist scheme that \n\nexploits consumer disaffection and risks \ndistorting the economics of democratic \ncapitalism.33Randall Rothenberg, president and \nchief executive of˜cer for the Interac-tive Advertising Bureau accuses ad blocking ﬁpro˜teersﬂ of ﬁstealing from \npublishers, subverting freedom of the press, operating a business model predicated on censorship of content, and ultimately forcing consumers to pay more money for lessŠand less di-\nverseŠinformation.ﬂ34On the other side of the debate, \nmany have pointed to the ads them-selves as fostering needless consump-tion while being tasteless, intrusive, \nand evil (this word occurs a lot in these \ndiscussions), while suggesting that the advertising industry brought ad block-ing upon itself.\n1There are purely technical issues as \nwell. The technology that allows Inter-\nnet advertisers to better target potential \nconsumers slows the loading of Web \n\npages and places a signi˜cant burden \non wireless cellular links, a burden \n\nthat is usually funded by unwilling us-\ners. The ad-blocking software provider \nShine, an Israeli startup that began life \nin 2011 as an anti-virus software devel-\noper, estimates that advertising con-sumes between 10% and 50% of user \ndata plans, depending on user location. \nA typical mobile gaming app with adver-tising was found to consume 5Mb over a \n\n˜ve-minute session, but only 50Kb with \nad blocking in place.17Shine produces ad-blocking soft-ware that can be incorporated into \n\ncellular datacenters. In June 2016, the U.K. cellular service provider Three be\n-\ncame the ˜rst to conduct trials using this software to block ads on cellular data connections.\n12 Given that mar\n-keters are expected to have spent over $100 billion on mobile ads in 2016,10 the response is expected to be extreme.In this article, we explore how adver-tising networks and ad blockers work. \nWe further consider how ad blockers \nare subverted, and whether they are eth-ical. The ethical analysis yields mixed \nresults, but it does, however, suggest a \nsolution that empowers users, allowing \n\nthem to select the types of ads that they \nsee and how often they see them.The Technology of Ad \nNetworks and Ad Blockers\nWeb browsers request a Web page \nfrom a server by sending an HTTP GET command to the appropriate Internet \nhost. The host responds with HTML code that the Web browser uses to ren\n-der the desired page and present it to \nthe user. This much is both simple and \nubiquitous, but the details, particularly when advertising is involved, are much \nmore complicated.Internet ad delivery is a complex process involving multiple redirections, synchronization of \nuser information, and an auction, all in a few tens of milliseconds.\n\n\n†“‘\nOCTOBER 2017  \n|  VOL. 60  \n|  NO. 10  \n|  COMMUNICATIONS OF THE ACM\n    73review articles\nbe linked to the cookie IDs. The DMP \nmay take this a step further by including \ninformation inferred from the user™s \nsocial media activity, purchase history \n\non various sites, search history, and \nemail messages. Finally, the DMP may \nhave access to data gathered of˚ine. \nData aggregators are known to collect \ndata from publicly available records, in-\ncluding licensing records (for example, \nlicenses for doctors, lawyers, pilots, or \nhunters or ˜shermen licenses), voter \n\nregistration databases, court records, \nand DMV records, as well as buying data \nfrom commercial sources including \nbrick-and-mortar store purchase histo\n-ries and transaction information from \n\n˜nancial services companies.9 Data ag-gregators also buy and sell information \nfrom each other. This whole system of \ntransactions is often referred to as ﬁthe \n\ndata economy.ﬂ Through this data econ\n-omy, the DMP is able to build a strik-ingly detailed simulacrum of an indi-vidual consumer, a simulacrum whose \naccuracy drives the advertisers™ return \n\non investment, and whose inaccuracy \nmay drive the consumer to distraction.If a DSP determines the user pro˜le \n˜ts its target audience, it places a bid for \n\nadvertising space on the web page being \nrendered by the host computer. The ad \nexchange selects an ad from among the \nbidding DSPs; a Vickrey auction is gen-\nerally used, where the highest offer is \nselected and the amount paid is that of-fered by the second highest bidder. The \n\nwinning DSP provides a URL for retriev-ing the ad. In an ﬁimpressionﬂ-based \nsystem, an agency ad server determines \n\nwhether the ad is actually downloaded, \nand pays the publisher accordingly, \nwith the cost per thousand impressions \n(CPM) being the most widely used sta-tistic in Internet advertising.35 All of this \nhappens within tens of milliseconds, \nthough the actual loading of the win-ning ad into the user™s browser may take \n\nfar longer depending on the bandwidth \nof the user connection and the size of \nthe ad.As a result of this process, the pub-lisher of the content often has limited \ncontrol over the safety, quality, or taste-fulness of the ad seen by the content \nconsumer. A publisher may, for exam\n-\nple, be able to prevent advertisements from a particular advertiser or class of advertisers, but she may not be able to exercise ˜ner control. Ad blockers can use several methods to disrupt the process described ear-\nlier, thus prevent ads from being dis-played. Many prominent ad blockers, \nsuch as Adblock Plus and its variants, block ads by preventing the browser from sending HTTP requests to certain \nURLs. The URL blacklist for a given blocker is often a crowd sourced effort, such as EasyList, the default blacklist \n\nused in Adblock Plus. EasyList is prob-ably the most widely used blacklist; the number of EasyList downloads was \nused by PageFair and Adobe to esti\n-mate the prevalence of ad blocking in \ntheir 2015 joint report.30While URL blacklisting appears to be \nthe most common method of ad block-ing, the Electronic Frontier Founda\n-tion™s Privacy Badger takes a different \n\napproach,36 attempting to learn which \ndomains and sites are tracking a user \nand blocking the ones that do. It detects \nbehavior such as the use of uniquely \n\nidentifying cookies, canvas ˜ngerprint-ing, and the appearance of the same \nthird-party site at multiple domains. As \nsuch, it blocks very few domains at ˜rst, \nbut the more it is used, the more it learns \n\nto block. It should be noted that Privacy \nBadger aims to prevent tracking, not \nads; but since the two are intimately con\n-\nnected, it often serves both purposes.A third ad blocking method blocks website elements ˜tting certain pat-terns; for example, it could look for the ﬁiframeﬂ HTML tag and check to see \nif it contains text strings like ﬁSpon\n-soredﬂ or links to a URL with the word ﬁadﬂ in it. This method can block ad-\nvertising served by the Web site itself \nas opposed to just third parties, adver-tising that includes ads embedded in \nsearch results and social media feeds. This content ˜ltering can happen \nat the client or at an intermediate \nproxy. Some ad blockers use a root cer\n-ti˜cate to redirect browser requests to \n\na VPN or proxy that removes ad con-tent using the methods previously \nmentioned before forwarding the \n\nHTML code to the browser. This ap\n-proach can block ads for mobile apps \nas well as browsers, but it comes with \nthe risks associated with having third \nparties interfere with browser traf˜c, \n\nrisks that include the classic man-in-\nthe-middle attacks. Apple recently re-moved several ad-blocking apps from \n\nits app store on this basis.37Given the amount \n of money involved \n in advertising, \n one might expect \n a certain amount \n of invective on \n the subject \n of ad blocking. \n One would \n be correct. \n74    COMMUNICATIONS OF THE ACM\n   |  OCTOBER 2017  \n|  VOL. 60  \n|  NO. 10\nreview articles\nthe ad, only serving malvertising every \n10th or 20th time, and not serving mal-vertising to certain IP addresses.\n5 Even \nlarge and reputable websites have been known to accidentally serve malvertis-ing, making malvertising a potential \nproblem for every Internet user.\nIs Ad Blocking \n a Breach of Contract?\nIt would take a long law review article, \n and one written by another set of au-thors, to properly address the legality of \nad blocking. We do, however, wish to ad\n-\ndress the oft-cited argument that the pro-vision of free content that contains ads \nis done under an ﬁimplicit contract.ﬂ41 Under this contract, the consumer is \nprovided with free content in return for \nthe user™s agreement to view advertise-\nments. This is not a new argument, as it \nhas been applied by network executives \nto broadcast television for many years, \nsometimes in a very extreme form. In \n2002, Jamie Kellner, then CEO of Turner \n\nBroadcasting, suggested that any sys-tematic practice of using the bathroom \nduring commercials was stealing.7In the U.S., the legal concept under\n-lying this argument is the ﬁimplied-in-factﬂ contract.b The law is summarized as follows:To establish the existence of an implied \nin fact contract, it is necessary to show: an \nunambiguous offer, unambiguous ac\n-ceptance, mutual intent to be bound, \nand consideration. However, these ele\n-ments may be established by the conduct \nof the parties rather than through express \n\nwritten or oral agreements.\n42As an example, suppose you agree to wash your neighbor™s car once a week. You receive payment for each of the \n˜rst six weeks, but upon washing his \ncar the seventh time, your neighbor refuses to pay because there was no written agreement. Most courts would agree that there was an implied-in-fact contract as evidenced by the conduct of \nthe parties for the ˜rst six weeks. Your \nneighbor has to pay.\nNow consider a real example in \nwhich it was found that there was no b U.S. contract law allows for two other types of \ncontracts: express contract (written) and im-plied-in-law contracts (also called ﬁquasi con-tracts,ﬂ they are more legal obligations than true \n\ncontracts). We only address U.S. contract law \nhere; other jurisdictions may be substantially \ndifferent, and are well beyond our expertise.Publishers will sometimes try to cir-cumvent attempts at ad blocking. Anti-ad blocking usually works by serving a \nfake ad in some way and verifying that \n\nit has been loaded or displayed. If it fails \nto load, the site stops displaying the pri\n-mary content or refuses to load it in the \n˜rst place. For example, a site can con\n-tain an iframe ostentatiously marked as \n\nﬁAdvertisingﬂ and then use JavaScript \nto see if it was displayed.a If the iframe \nis not displayed, the site does not pro-\nvide the primary content. Similarly, the \nbrowser can be directed to load a JavaS-\ncript with a name, such as ﬁads.js,ﬂ that \ncan be found in common ad blocker \n˜lter rules and check to see if it is run. \nAside from trying to explicitly detect ad \nblockers, ad networks can obfuscate the \n\nURLs of their ads, such as by using IP \naddresses instead of domain names.Ad blockers can often adapt, circum-venting new anti-ad blocking mecha-\nnisms. Facebook recently announced it \nwould prevent ad blocking,38 only to have \nAdblock Plus announce a few days later \nthat it found a way to defeat Facebook™s \nprevention technique.39 This is but one \nexample of the evolving arms race be-tween publishers and ad blockers.16Though the initial motivation for ad blocking may be annoying ads or track-\ning, increased computer security is a \nmajor side bene˜t. Online ads are usu-\nally pieces of code as opposed to static images or text. The end result of the ad auction process described earlier is that the user™s browser is redirected \nto a URL of the advertiser™s choosing. \nThe retrieved object may take the form of JavaScript, Flash, or even Java code. \nVulnerabilities in these frameworks \ncan be used to execute malicious code on the client machine without the user noticing anything out of the ordinary. \nEven though browser support for Java and Adobe Flash is being phased out,40 vulnerabilities in these frameworks are still being exploited. Java exploits are on the decline, but Flash vulnerabili\n-\nties are still some of the most common vehicles for malvertising.4 While ad net-works have measures in place to detect \nmalvertising, there are ways to circum-vent and avoid detection, at least tem-\nporarily, such as serving a legitimate ad until the ad network has approved a See, for example, http://adblockingdetector.\njohnmorris.me/how-thisplugin-works/.Publishers will \nsometimes try \n\nto circumvent \n\nattempts at ad \n\nblocking. Anti-ad \n\nblocking usually \n\nworks by serving \n a fake ad in some \n\nway and verifying \n\nit has been loaded \n\nand displayed. \nOCTOBER 2017  \n|  VOL. 60  \n|  NO. 10  \n|  COMMUNICATIONS OF THE ACM\n    75review articles\nimplied-in-fact contract. In 1917, the U.S. leased a pier from the Baltimore \nand Ohio railroad for the purpose of handling supplies destined for the \nwar in Europe. An earlier ˜re was be-lieved to have been an act of sabotage, so soldiers were deployed to guard the pier and surrounding equipment. The weather was cold, and the troop com-\nmander often complained about the tents in which his men were forced to live. A railroad of˜cial offered to build \ntemporary barracks. Though there was never any discussion of compensation, the barracks were built. The railroad \nlater sued to recover the cost of the construction, arguing there had been \nan implied-in-fact contract. In what be-came the 1923 case of Baltimore & Ohio R. Co. v. United States\n,2 the Supreme Court disagreed. The Court stated that \nan ﬁimplied agreementﬂ required ﬁa meeting of minds inferred, as a fact, \nfrom conduct of the parties in the light \nof surrounding circumstances.ﬂ The Court found there had been no such meeting of minds, as the railroad com-pany never intimated that it would ex-\npect payment from the government. It follows that there are several rea\n-sons the alleged quid pro quo of viewing \n\nads in return for free Internet content \nfails to rise to the level of an implied-in-fact contract. First, as with the Baltimore \n& Ohio case, there was no unambiguous \noffer. The Internet content consumer \n\nis rarely told precisely what is going to \nbe loaded into his or her Web browser, \nand what is expected in return. Con-\ntent consumers suffer the embedding \nof ads and, on occasion, trackers and \nother forms of spyware into their Web \n\nbrowsers without receiving any notice \nfrom the content provider whatsoever. \nIn fact, as we have seen, the content pro-vider may not know what is being inject-ed into the consumer™s browser.\nSecond, the alleged agreement fails to satisfy the unambiguous acceptance \nelement. Unlike the lawn-mowing ex-\nample, there is no prior conduct that indicates a general understanding that an agreement is in place. The popular-ity of ad blockers20,30,31 indicates that most consumers do not want to see the \nads, and clearly have not agreed to do so. A Reuters survey provides further \n\nevidence, indicating that even those who do not employ ad blockers are ig\n-noring or avoiding the ads: More generally, a third or more (39% \nin the U.K. and 30% in the U.S.) say they \n\nignore ads. Around three in 10 (31%/29%) say they actively avoid sites where ads in-terfere with the content.20Are Ad Blockers Unethical?\nIn After Virtue, Alasdair MacIntyre de-scribes the breakdown in ethical argu\n-\nment that occurs when the foundations \nfor ethical systems are cut away, leav-ing proponents of differing perspec-tives to argue past each other without any basis for decisive engagement.14 Ad blocking provides a canonical exam-\nple, as we have one group arguing for individual rights (the right to receive \npayment for one™s effort in providing content), while the other group argues for the general welfare (an Internet de-void of continual distraction caused by tasteless advertising). It is not clear \nhow the two arguments can be recon-ciled, or how one can clearly overcome the other. We suggest a solution lies in \n\na technologically mediated meeting \nof minds, but before we consider the solution, we offer a more detailed ac-count of the ethical arguments. The utilitarian approach, ˜rst pro-pounded by Jeremy Bentham and John \nStuart Mill in the late 18\nth and early \n19th centuries, is based on the famil-iar precept that ﬁit is the greatest hap-\npiness of the greatest number that is the measure of right and wrong.ﬂ3 In what follows, we will consider act utili-tarianism, which focuses on the conse-\nquences of individual actions. We will \n\nalso substitute ﬁwell-beingﬂ for ﬁhappi-nessﬂ to counter some of the more ob-vious criticisms of utilitarianism. Does the use of ad blockers create the greatest well-being for the greatest \nnumber? Those affected by the deci-sion to block ads include the following: ˜Ad blocking users, ˜Ad viewing users, ˜Content generators, ˜Content publishers, and ˜AdvertisersShould users choose to employ ad \nblockers, the following will arguably result: ˜The ad blocking users will see few-er advertisements. ˜The content generators will receive less revenue per reading user.\n ˜The content publishers will receive less revenue per reading user.\n ˜Advertisers will seek other venues for their advertising dollars. ˜Some content generators will stop generating content. ˜Some content publishers will stop \npublishing content. ˜Some content publishers will pub-lish content of lower quality.\n ˜There will be less free content available to all users on the Internet, and the content that remains freely available will, in some cases, be of re-\nduced quality.\nIt is important to provide some con-text for the suggestion that the quality \nof online content will be diminished by \na general acceptance of ad blocking. \n\nNewspaper journalism was in decline \nwell before the advent of ad blocking, or \neven the advent of the Internet, primar-\nily because of the failure of its core busi-ness model.15 The business model was \nthat of a quasi-monopoly: competition \n\nwas limited, so that a local paper could \ncharge higher prices for advertising, \n\nand then use the revenue to maintain \nreporters across the world. In essence, \nthe local Wal-Mart paid for the Bagh\n-dad bureau through its advertising dol\n-lars. The limit on competition was due \n\nto a fact of technology: printing presses \nwere very expensive to operate and \nmaintain, so all but the largest munici-\npalities could only sustain one or two \n(print) newspapers at any given point in \ntime.22 In a pre-Internet world, the pa-pers acted as an intermediary between \nadvertisers and consumers, charging \nboth for the opportunity to communi-\ncate. In a multi-newspaper market, the \nequilibrium was often unstable; a nota\n-ble scoop could send more advertising \ndollars to the scooping paper, allowing \nthe scooper to grow (literally) fatter and \n\nmore attractive to the buyers.The unraveling of this relationship began with the television era and the \nmovement of af˚uent readers from the inner city to the suburbs. National and retail advertisers moved their dollars to television, and newspapers came to depend more on classi˜ed ads.6 With the advent of the Internet in general and Craig™s List in particular (founded in 1995), classi˜ed advertising revenue \nalso began to leave the newspapers™ balance sheets. By 2010 the newspa-per industry was in deep decline, with many major players facing bankruptcy (for example, the Tribune Company in 76    COMMUNICATIONS OF THE ACM\n   |  OCTOBER 2017  \n|  VOL. 60  \n|  NO. 10\nreview articles\nhuman values. For example, in \nEthical IT \nInnovation, Sarah Spiekermann points \nto both Aristotle and Maslow while con-cluding that technical design must be \n\nbased on an understanding that knowl\n-edge, freedom, and autonomy are pre-conditions for human growth, self-es-teem, friendship and self-actualization.24 At best, the design of advertising \ntechnology shows little concern for \nknowledge, freedom, and autonomy of \n\nconsumers. At worst, advertising tech-nology actively works to subvert these \nvalues. This subversion can be seen \nthrough the lens of the ﬁattention econ-omy,ﬂ a term coined by Herbert Simon \n\nto capture the ˜nite nature of the indi\n-viduals™ attention in the face of a seem-ingly in˜nite amount of information.\n23 The attention economy is re˚ected in \nadvertisers™ insertion of themselves \ninto virtually all personal interacti ons \n\nin everyday life, ranging from highway \nbillboards to doctors™ of˜ces to the bot-toms of the trays at airport security. \nWriting for the ﬁPractical Ethicsﬂ blog \nof Oxford University, James Williams \n\nargues the resulting distractions are \nmore than an annoyance, they ﬁkeep us \nfrom living the lives we want to live:ﬂIn the short term, distractions can keep \nus from doing the things we want to do. In \n\nthe longer term, however, they can accu\n-mulate and keep us from living the lives \nwe want to live, or, even worse, undermine \n\nour capacities for re˛ection and self-reg-ulation, making it harder, in the words of \nHarry Frankfurt, to ﬁwant what we want \n\nto want.ﬂ Thus there are deep ethical im-plications lurking here for freedom, well-being, and even the integrity of the self.\n19From a virtue ethics standpoint, it follows that the design of Internet ad-vertising technology is itself unethi-cal in that it works against the human \nproject of self-creation. Ad blockers are thus not only ethical, but are literally a matter of self-defense. Quoting the Practical Ethics blog once again: In reality, ad blockers are one of the few \ntools that we as users have if we want to \n\npush back against the perverse design logic \nthat has cannibalized the soul of the Web.\n6Solutions and Conclusion\nThe advertising delivery systems de-scribed in this article are the antith-esis of value-based design. The values \n\nthat Spiekermann and others point \nto as a foundation for virtue-based \n2008), and others left to cope with dra-matically reduced staffs. The consequences of a general use \nof ad blockers may thus be character-ized as a further reduction in the quality \nof free online content through the de-\nparture of some Internet content gen-erators and publishers to other ways of \nmaking a living. For large numbers of \n\nconsumers these are apparently accept-able outcomes given what they avoid: \nthe problems associated with spyware \nand the relentless distraction of advertis-ing. There is also evidence that Internet \n\nreaders do not greatly value what they are \nreading; given the choice between pay\n-ing for the content and losing it, most \n\nprefer the latter. The aforementioned \nReuters survey found that only 10% of on\n-line users appeared to be willing to pay \n\nfor once-free news content. \nAfter a sharp upturn in 2012Œ2013Šwhen a large number of paywalls were \nintroducedŠour data shows very little \nchange in the absolute number of people \n\npaying for digital news over the past year. \nIn most countries the number paying for \nany news is hovering around 10% of online \n\nusers and in some cases less than that.20If Internet readers and users of ad \nblockers are rational actors who are \nmaking decisions based on their indi\n-vidual well-being, and as the readers \n\noutnumber the writers and advertis-ers, one may conclude that the use of \nad blockers provides the greatest well \nbeing for the greatest number. From a \nutilitarian perspective, ad blocking is \n\nethical; the content providers should \nlook for a better business model.The counterargument is ready at \nhand: this analysis clearly does not \n\ntake into account all stakeholders; the \ncontent generators and publishers, for \nexample, would almost certainly not be \npleased with the consequences of this \n\nutilitarian calculus. This is an example \nof a key criticism of utilitarianism; \nnamely, that in emphasizing aggregate \n\nwell being, some individuals may be left \nin far worse condition than before.A deontic analysis avoids this par-ticular problem. Immanuel Kant sug\n-\ngested in his Groundwork of the Meta-physic of Morals that there is a single \nprimary moral obligation, which he re-ferred to as the ﬁcategorical imperativeﬂ \n\n(CI). Kant offered several formulations \nof CI, including one that sounds very \nmuch like the golden rule: ﬁact so that \nyou use humanity, as much in your own \nperson as in the person of every other, \nalways at the same time as end and \n\nnever merely as means.ﬂ13 Ad blocking \nreaders arguably do not satisfy this for-mulationŠthey treat the content gen-erators as means rather than an end in \n\nthemselves, taking their work product \nwithout respecting their efforts to make \na living. It appears that Kant is on the \nside of the advertisers, while Bentham \nfavors the general reader. \nContractualism, an ethical theory \nrelated to Kant™s deontological ap\n-\nproach,18 more clearly takes into ac-count all interested parties, while \npointing to a potential solution. In \nWhat We Owe Each Other\n, T.M. Scan\n-\nlon21 offers the following ethical rule \nfor action (emphasis added):An act is wrong if its performance under \nthe circumstances would be disallowed by \n\nany set of principles for the general regu-lation of behavior that no one could rea\n-sonably reject as a basis for informed, un-forced, general agreement.In establishing rules for behavior, \nScanlon suggests that we must consid\n-\ner the perspectives of all stakeholders, \nand de˜ne a basis for informed general \n\nagreement. This would require com-munication between all stakeholders, \nsomething that is sorely lacking in the \ncontext of online advertising. We will \nreturn to this point when we consider \n\npossible solutions. \nThe third and ˜nal approach to be \nconsidered shifts the balance of the \n\nargument in favor of the general reader, \nbut on a far ˜rmer basis than the argu-ments of Bentham et al. Aretaic, or vir-tue ethics, emphasizes virtues of mind \nand character.\n8,11 Virtue ethics origi-nated with Aristotle™s Nicomachean \n\nEthics and his notion that the ultimate \naim (telos) of an individual is to live \na virtuous life. A virtuous life is a life \nlived according to reason, where deci-sions are based on a set of values held \ndear by the individual. Virtue ethics \nthus involve the questions of ﬁwhat is \n\ndesirable, good or morally worthwhile \nin life?ﬂ ﬁWhat values should we pur-sue for ourselves and others?ﬂ8 Virtue ethics has enjoyed a recent \nresurgence, both in philosophy depart-\nments and in schools of technology. \n\nWith regard to the latter, value-based \ndesign practices have been developed \nbased on various lists of fundamental \nOCTOBER 2017  \n|  VOL. 60  \n|  NO. 10  \n|  COMMUNICATIONS OF THE ACM\n    77review articles\nReporter Please Turn out the Lights: The Collapse of \nJournalism and What Can Be Done To Fix It. \nThe New Press, NY, 2011.\n16. Nithyanand, R. et al. Adblocking and Counter-Blocking: \nA Slice of the Arms Race (2016); arXiv:1605.05077. \n17.\n O™Reilly, L. This ad blocking company has the potential \nto tear a hole right through the mobile WebŠand it \nhas the support of carriers. BusinessInsider.com, May \n13, 2015.18. Par˜t, D. \nOn What Matter 1 (2011), 412Œ413. Oxford \nUniversity Press.\n19. Practical Ethics Blog. University of Oxford; \n http://blog.practicalethics.ox.ac.uk/2015/10/why-its-\nok-to-blockad20. Reuters Institute Digital News Report 2015. Reuters \nInstitute, University of Oxford, https://reutersinstitute.\npolitics.ox.ac.uk/sites/default/˜les/Reuters%20Institute%20Digital%20News%20Report%202015_\nFull%20Report.pdf\n21. Scanlon, T.M. \nWhat We Owe Each Other.\n Belknap Press, Cambridge, MA, 2000.22. Shirky, C. Newspapers and thinking the unthinkable. \n\nWill the Last Reporter Please Turn out the Lights: The \nCollapse of Journalism and What Can Be Done To \nFix It. R.W. McChesney and V. Pickard, Eds. The New \nPress, NY, 2011.\n23. Simon, H.A. Designing organizations for an information-rich world. Computers, Communications, and the Public Interest. Johns Hopkins University \n\nPress, Baltimore, MD, 1971.\n24. Spiekermann, S. Ethical IT Innovation: A Value-Based \nSystem Design Approach. \nCRC Press, Boca Raton, FL, 2015.25. http://www.tomsguide.com/us/ad-blocking-is-\n\nstealing,news-20962.html\n26. http://blog.practicalethics.ox.ac.uk/2015/10/why-its-\nok-toblock-ads/27.\n https://developer.apple.com/library/ios/releasenotes/\n\nGeneral/WhatsNewIniOS/Articles/iOS9.html\n28. https://adblockplus.org/blog/adblock-plus-for-ios-9-\n˜nallyhere-and-pssst-it-s-free\n29. http://time.com/4052033/apple-iphone-ios-9-ad-blockers/\n30. https://blog.pagefair.com/2015/ad-blocking-report/\n31. https://pagefair.com/downloads/2016/05/Adblocking-\nGoes-Mobile.pdf32. http://fortune.com/2015/09/18/dear-apple-i-may-rob-\n\nyourstore/ http://www.tomsguide.com/us/ad-blocking-\nisstealing,news-20962.html\n33. http://adage.com/article/digitalnext/ad-blocking-\nunnecessaryinternet-apocalypse/300470/\n34. http://www.iab.com/news/rothenberg-says-ad-\n\nblocking-is-awar-against-diversity-and-freedom-of-\n\nexpression/35. http://www.allbusiness.com/web-advertising-and-\n\ncpm-aquick-guide-for-small-businesses-2646-1.html\n36. https://www.eff.org/privacybadger\n37.\n http://www.theguardian.com/technology/2015/oct/09/\n\nappleremoves-iphone-adblockers-facebook-third-\nparty-apps\n38. http://www.wsj.com/articles/facebook-will-force-\n\nadvertisingon-ad-blocking-users-1470751204\n39. http://www.cnet.com/news/facebook-adblock-\nplusworkaround-august-11\n40. http://www.extremetech.com/computing/209888-\n\nmozilla˜refox-kills-˚ash-by-default-security-chief-\n\ncalls-for-adobe-toissue-an-end-of-life-date, http://\nwww.bbc.com/news/technology-36301904\n41. http://www.computerworld.com/article/2487367/\necommerce/ad-blockers--a-solution-or-a-problem-.html\n42.\n https://www.law.cornell.edu/wex/contract_implied_in_fact\nStephen B. Wicker \n(wicker@ece.cornell.edu) is a professor in the School of Electrical and Computer Engineering at Cornell University, Ithaca, NY.\nKolbeinn Karlsson \n(kk752@cornell.edu) is a graduate \nstudent in the School of Electrical and Computer Engineering at Cornell University, Ithaca, NY.\n© 2017 ACM 0001-0782/17/10 $15.00\ndesignŠknowledge, freedom, and \nautonomyŠare precisely the values \nthat online advertising systems most \nsystematically undermine. \nInternet advertisers exchange in-formation about users without their \n\nknowledge or control, using that in-formation to manipulate users into \nbehavior they might not otherwise \n\nhave exhibited. This summary may \nseem harsh, and some may argue that \nadvertisers would happily engage in \n\nmore ethical behavior if better chan\n-nels of communication were provided \nto interested consumers. A solution \nbene˜cial to all may lie in a virtue-based redesign. Such a redesign would \n\nembed T.M. Scanlon™s suggestion that \nthere be an ﬁinformed, unforced, gen-eral agreementﬂ among all parties. \n\nThe agreement would be based on a \nsystem that provides revenue for con-tent generators and connects adver-\ntisers to interested consumers while \nreducing the deleterious impact of \nthe current system of advertising on \nthe reading public. The key step lies in \nempowering the reading/consuming \n\npublicŠletting them choose whether \nthey will download ads, and if so, what \ntype of ads. Should a reader choose \n\nnot to download ads, he or she should \nbe given the opportunity to pay for ad-\nfree content.The supporting technology for \nsuch a system already exists in the cur-\nrent ad networks. Recall the current \nscheme of directed Internet advertis-ing relies on the use of cookies stored \non user machines. These cookies are sent to service-side and demand-side platforms to obtain directed advertis-\ning for insertion into content initially requested by a user. Suppose the cook\n-ies are replaced by information explic-itly provided by the user that indicates buying habits and interest in speci˜c \nconsumer goods. The data manage-ment platform (DMP) would request, coordinate, and update this user-sup-\nplied information as necessary. Rather \nthan inferring potential sales from browsing habits, advertising networks \ncould make advertising bidding deci-sions based on the clearly expressed \ndesires of potential consumers. Such a system would increase the agency of the browsing user, while potentially \nincreasing return on investment for advertisers. Such a solution will require careful \ndesign and far more communication \n\nbetween stakeholders than currently \ntakes place, but it offers the potential \n\nfor clearly informing readers of their op-tions, options upon which they can ex-ercise rational choice in pursuit of their \nown individual goals. We hope that ad\n-vertisers see this as an opportunity. \nWe have argued that ad blocking is \nnot a violation of an existing contract \n(at least in U.S. law). This does not \n\nmean that ad blocking is beyond the reach of earnest lobbyists and subse-quent legislation. One might expect, however, that such legislation would not be very popular with the general \npublic. We hope the agreement sug\n-gested here takes form before the bat-tle between advertisers and ad block-\ners escalates any further.\nAcknowledgmentsThe authors greatly acknowledge the \nassistance of Sarah Wicker and Adam \nEngst with several technical, legal, \nand ethical issues. We also thank the \neditor and reviewers for their time, ef-\nfort, and expertise. References1. Alexander, J., Crompton, T. and Shrubsole, G. Think \nOf Me As Evil? Opening The Ethical Debates In \nAdvertising. Public Interest Research Centre (PIRC) \nand WWF-UK, Oct. 2011.2. Baltimore & Ohio R. Co. v. United States\n 261 U.S. 592 (1923)3. Bentham, J. A fragment on government. (1776). \n\nReprinted in The Collected Works of Jeremy Bentham\n. J.H. Burns and H.L.A. Hart, eds. The Athlone Press, \nLondon, U.K. 1977, 393.\n4. Cisco. Cisco 2016 Midyear Cybersecurity Report; \n\nhttp://www.cisco.com/c/m/en_us/offers/sc04/2016-\nmidyearcybersecurity-report/index.html.\n5. Cyphort Labs. The Rise of Malvertising, 2015; http://\ngo.cyphort.com/Malvertising-Report-15-Page.html.\n6. Downie, Jr., L. and Schudson, M. The reconstruction \n\nof American journalism. Will the Last Reporter Please \nTurn out the Lights: The Collapse of Journalism and \nWhat Can Be Done To Fix It.\n R.W. McChesney and V. \n\nPickard, eds. The New Press, NY, 2011.\n7. EFFector 15\n, 15 (May 24, 2002); https://www.eff.org/\n\neffector/15/158. Frankena, W. \nEthics \n(2nd Edition). Prentice Hall, Upper \nSaddle River, NJ, 1973.\n9. FTC. Data Brokers: A Call for Transparency and \n\nAccountability; https://www.ftc.gov/system/˜les/\ndocuments/reports/data-brokerscall-transparency-\naccountability-report-federal-trade-commissionmay-\n\n2014/140527databrokerreport.pdf\n10. Hof, R. Mobile ads will smash $100 billion mark \nworldwide in 2016. Forbes\n (Apr. 2, 2015); http://www.\n\nforbes.com/sites/roberthof/2015/04/02/mobile-\nadswill-smash-100-billion-mark-worldwide-in-2016\n11. Hursthouse, R. On Virtue Ethics.\n Oxford University \n\nPress, 2002.12. Jackson, J. Three network to run 24-hour ad \nblocking trial. The Guardian (May 25, 2016); https://\nwww.theguardian.com/media/2016/may/26/three-\nnetworkto-run-24-hour-adblocking-trial\n13. Kant, I. Groundwork for the Metaphysics of Morals. \n \nA. Wood, ed. Yale University Press, 2002, 37.\n14.\n MacIntyre, A. \nAfter Virtue: A Study in Moral Theory\n (3rd Edition). University of Notre Dame Press, South \nBend, IN, 2007.\n15. McChesney, R.W. and Pickard, V. Eds. \nWill the Last \nWatch the authors discuss \n their work in this exclusive \n Communications video. \n https://cacm.acm.org/videos/\n\ninternet-advertising\n"}